#### 1. 아래 문장을 "vs." 앞뒤로 분리해보기

In [1]:
import re

pattern = re.compile('vs.')
a = pattern.split('Spider man vs. Super man.')
b = pattern.split('Iron man vs. Ultron')
print(a)
print(b)

['Spider man ', ' Super man.']
['Iron man ', ' Ultron']

#### 2. 계좌번호에서 숫자만 수출하기

In [14]:
a = 'KB 231401-04-296081'
b = 'NH 301-0173-716502'

pattern = re.compile('[^0-9]')
a_kb = pattern.sub('',a)
b_nh = pattern.sub('',b)

print(a_kb)
print(b_nh)

23140104296081
3010173716502

## 개인톡
#### 1. 학번에서 입학년도만 **으로 변경하기 (정규표현식 사용)

In [35]:
import re
data = input()

student= re.compile("(\d{2})(\d{2})(\d{4})")
print(student.sub("\g<1>**\g<3>",data))

60191107
60**1107

### 2.  비번 인증 만들기 (정규표현식 사용)

In [40]:
def pw_check(pwd):
    if len(pwd) < 8:
        print("비밀번호는 최소 8자 이상이여야 합니다")
        return False 
    elif len(pwd) > 11:
        print("비밀번호는 최대 11자 미만이여야 합니다")
        return False
    elif re.search('[~!@#$%^&*()><.,/\|?+=-]',pwd) is None :
        print("비밀번호는 최소 1개 이상의 특수문자가 필요합니다 #,@,&을 추가해주세요")
        return False
    elif re.search('[#@&]',pwd) is None :
        print("특수기호는 #,@,&만 사용해주세요")
        return False
    else: 
        print('비밀번호가 만들어졌습니다')
        return True
    
password = input()
pw_check(password)

rebeccma$
특수기호는 #,@,&만 사용해주세요

False

### 3. Mr은 남성, Miss는 미혼여성, Mrs는 기혼여성 나머지는 기타로 분류

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
train = pd.read_csv('data/train.csv')
test = pd.read_csv('data/test.csv')

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
train["Title"] = 0
for i in train:
    train["Title"] = train.Name.str.extract('([A-Za-z]+)\.')
train["Title"].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [16]:
train['Title'].replace(['Miss','Mr','Mrs','Mlle','Master','Mme','Ms','Dr','Major','Lady','Countess','Jonkheer','Col','Rev','Capt','Sir','Don'],\
                        ['미혼여성','남성','기혼여성','미혼여성','기타','미혼여성','미혼여성','남성','남성','기혼여성','기혼여성','기타','기타','기타','남성','남성','남성'],inplace=True)
train.groupby('Title')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,남성
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,기혼여성
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,미혼여성
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,기혼여성
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,남성

In [23]:
train[['Title', 'Survived']].groupby('Title').mean()

       Survived
Title
기타     0.489796
기혼여성   0.795276
남성     0.162571
미혼여성   0.704301